
// ===========================================================================
// 마우스 커서를 아이템에 갖다 대면,
// 1. "[E] 아이템 들기" 라는 문구를 나타내고 ---------------------------------[ ]
// 2. 아이템에 아웃라인 만들기 ----------------------------------------------[O]
// 3. [E] 키를 누르면 아이템 눈 앞으로 가져오기 ------------------------------[O]

// 아이템을 가져온 상태에서,
// 1. 가져온 상태에서 마우스 우클릭을 하고 마우스를 움직이면 아이템 회전하기 ---[ ]
// 2. 가져온 상태에서 마우스 좌클릭을 하면 아이템 던져버리기! -----------------[O]

// 아이템 뿌시기
// 1. 아이템이 어딘가에 부딪혔다면, 쪼갠다
// 2. 아이템이 공격당하면, 쪼갠다
// ===========================================================================
